Repository: 4elta/recon
Catalog: locales/*/LC_MESSAGES/rdp.po
Languages: de

source: protocol supported
de: Unterstütztes Protokoll

source: protocol not supported
de: Protokoll nicht unterstützt

source: could not read server certificate
de: Server Zertifikat konnte nicht gelesen werden

source: certificate contains private IP address
de: Zertifikat enthält private IP Adresse

source: certificate lifespan in days
de: Zertifikatslebenspanne in Tagen

source: server's certificate: signature algorithm
de: Serverzertifikat: Signatur Algorithmus

source: cipher preference
de: Cipher Präferenz

source: server does not appear to support any cipher suites
de: Server unterstützt scheinbar keine Cipher Suites

source: server accepts any signature algorithm
de: Server akzeptiert jeglichen Signaturalgorithmus

source: extension not supported
de: Extension nicht unterstützt

source: extension supported
de: Extension unterstützt

source: vulnerable to client-initiated renegotiation DoS
de: Anfällig für Client-initiated renegotiation DoS

source: potentially vulnerable to BEAST (Browser Exploit Against SSL/TLS): ciphers in CBC mode with SSL 3.0 or TLS 1.0
de: Potenziell anfállig für BEAST (Browser Exploit Against SSL/TLS): Ciphers im CBC Modus mit SSL 3.0 oder TLS 1.0

source: vulnerable to CRIME (Compression Ratio Info-leak Made Easy): TLS compression or SPDY header compression
de: Anfällig für CRIME (Compression Ratio Info-leak Made Easy): TLS Kompression oder SPDY Header Kompression

source: potentially vulnerable to BREACH: HTTP compression detected
de: Potentiell anfällig für BREACH: HTTP Compression erkannt

source: potentially vulnerable to Lucky Thirteen: ciphers in CBC mode
de: Potenziell anfällig für Lucky Thirteen: Ciphers im CBC Mode

source: vulnerable to Heartbleed: vulnerable version of the heartbeat TLS extension (OpenSSL 1.0.1 through 1.0.1f)
de: Anfällig für Heartbleed: anfällige Version der Heartblee TLS Extension (OpenSSL 1.0.1 bis 1.0.1f)

source: vulnerable to POODLE (Padding Oracle On Downgraded Legacy Encryption): SSL 3.0
de: Anfällig für POODLE (Padding Oracle On Downgraded Legacy Encryption): SSL 3.0

source: vulnerable to CCS (ChangeCipherSpec) injection: outdated version of OpenSSL
de: Anfällig für CCS (ChangeCipherSpec) Injection: veraltete Version von OpenSSL

source: vulnerable to FREAK (Factoring RSA Export Keys): RSA with moduli of 512 bits or less
de: Anfällig für FREAK (Factoring RSA Export Keys): RSA mit Moduli von 512 Bits oder weniger

source: vulnerable to Logjam: weak DH keys
de: Anfällig für Logjam: schwache DH Keys

source: vulnerable to DROWN (Decrypting RSA with Obsolete and Weakened eNcryption): SSL 2.0
de: Anfällig für DROWN (Decrypting RSA with Obsolete and Weakened eNcryption): SSL 2.0

source: vulnerable to Sweet32: DES/3DES
de: Anfällig für Sweet32: DES/3DES

source: vulnerable to Ticketbleed: insecure implementation for handling Session Tickets
de: Anfällig für Ticketbleed: unsichere Implementierung der Session Ticket Handhabung

source: vulnerable to ROBOT (Return Of Bleichenbacher's Oracle Threat): RSA for key exchange
de: Anfällig für ROBOT (Return Of Bleichenbacher's Oracle Threat): RSA verwendet als Key Exchange
